<a href="https://colab.research.google.com/github/lethikieuly/PANDAS-FUNCTION/blob/main/pandas_DataFrame_reset_index.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**STUCTURE**

DataFrame.reset_index(level=None, drop=False, inplace=False, col_level=0, col_fill='')

Reset the index of the DataFrame, and use the default one instead. If the DataFrame has a MultiIndex, this method can remove one or more levels.

In [2]:
import pandas as pd

In [3]:
df= pd.DataFrame ([('Linda', 'Female', 40.8),
                   ('Asex', 'Female', 41.0),
                   ('Blax', 'male', 50),
                   ('Square', 'male', 60),
                   ('Page', 'male', 70),
                   ('Tompkins', 'male', 55),
                   ('Als Place', 'Female', 56.52),],
                  index =['2000',"2001","2002",'2000',"2001","2002","2002"],
                  columns=("name","sex","Age"))
df

           name     sex    Age
2000      Linda  Female  40.80
2001       Asex  Female  41.00
2002       Blax    male  50.00
2000     Square    male  60.00
2001       Page    male  70.00
2002   Tompkins    male  55.00
2002  Als Place  Female  56.52

In [4]:
df.reset_index()
#When we reset the index, the old index is added as a column, and a new sequential index is used:

  index       name     sex    Age
0  2000      Linda  Female  40.80
1  2001       Asex  Female  41.00
2  2002       Blax    male  50.00
3  2000     Square    male  60.00
4  2001       Page    male  70.00
5  2002   Tompkins    male  55.00
6  2002  Als Place  Female  56.52

We can use the drop parameter to avoid the old index being added as a column:

In [5]:
df.reset_index(drop=True)

        name     sex    Age
0      Linda  Female  40.80
1       Asex  Female  41.00
2       Blax    male  50.00
3     Square    male  60.00
4       Page    male  70.00
5   Tompkins    male  55.00
6  Als Place  Female  56.52

You can also use reset_index with MultiIndex.